---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ExtrusionLength
source: html/29bc9fdb-9e7c-8123-8701-9b5a1e8dfe53.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ExtrusionLength Property

"Depth"

## Syntax (C#)
```csharp
public static ForgeTypeId ExtrusionLength { get; }
```